index=sysmon | rex field=CommandLine "(?<CommandLineMatch>(?i)(?:^|[\\s\\t\"])-e(?:c|n(?:c(?:o(?:d(?:e(?:d(?:c(?:o(?:m(?:m(?:a(?:n(?:d)?)?)?)?)?)?)?)?)?)?)?))(?:[\\s\\t\"=]|$))"
| eval CommandLineCondition=if(isnotnull(CommandLineMatch), "true", "false")
| rex field=CommandLine "(?<CommandLineMatch2>(?i)(?:^|[\\s\\t\"])-e[\\s\\t]+(?:[A-Za-z0-9+/]{80,}={0,2})(?:[\\s\\t\"]|$))"
| eval CommandLineCondition2=if(isnotnull(CommandLineMatch2), "true", "false")
| search Image IN ("*\\powershell.exe", "*\\pwsh.exe") CommandLineCondition="true" OR CommandLineCondition2="true" | table _time,ComputerName,User,Image,CommandLine,ParentImage,ParentCommandLine,ProcessId,ParentProcessId
