index=sysmon CommandLine="*HarddiskVolumeShadowCopy*" CommandLine IN ("*\\config\\SAM*", "*\\config\\SECURITY*") | table _time,ComputerName,User,Image,OriginalFileName,CommandLine,CurrentDirectory,IntegrityLevel,ParentImage,ParentCommandLine,ProcessId,ParentProcessId
