index=sysmon Image="*\\cmdkey.exe" OR OriginalFileName="cmdkey.exe" CommandLine="*/list*" | table _time,ComputerName,User,Image,OriginalFileName,CommandLine,CurrentDirectory,IntegrityLevel,ParentImage,ParentCommandLine,ProcessId,ParentProcessId
