index=sysmon Image IN ("*\\powershell.exe", "*\\pwsh.exe") ParentImage IN ("*\\winword.exe", "*\\excel.exe", "*\\outlook.exe", "*\\powerpnt.exe", "*\\mspub.exe", "*\\msaccess.exe", "*\\visio.exe", "*\\onenote.exe", "*\\mshta.exe", "*\\wscript.exe", "*\\cscript.exe", "*\\rundll32.exe", "*\\regsvr32.exe", "*\\iexplore.exe", "*\\firefox.exe", "*\\chrome.exe", "*\\msedge.exe", "*\\acrord32.exe", "*\\acrobat.exe", "*\\wmiprvse.exe", "*\\pcalua.exe", "*\\searchprotocolhost.exe", "*\\msdt.exe", "*\\msiexec.exe", "*\\wordpad.exe", "*\\teams.exe", "*\\msedgewebview2.exe") | table _time,ComputerName,User,Image,CommandLine,CurrentDirectory,IntegrityLevel,ParentImage,ParentCommandLine,ProcessId,ParentProcessId
