index=sysmon Image IN ("*\\powershell.exe", "*\\pwsh.exe") CommandLine IN ("*AmsiUtils*", "*amsiInitFailed*", "*AmsiScanBuffer*", "*amsi.dll*", "*AmsiOpenSession*", "*AmsiScanString*", "*amsiContext*", "*amsiSession*", "*AmsiInitialize*", "*AmsiCloseSession*") | table _time,ComputerName,User,Image,CommandLine,CurrentDirectory,IntegrityLevel,ParentImage,ParentCommandLine,ProcessId,ParentProcessId
