index=sysmon (Image="*\\taskmgr.exe" TargetFilename="*lsass*" TargetFilename="*.dmp") OR (TargetFilename="*lsass*" TargetFilename="*.dmp") NOT (Image IN ("*\\WerFault.exe", "*\\WerFaultSecure.exe")) | table _time,ComputerName,User,Image,TargetFilename,ProcessId,ParentImage
