index=sysmon Image IN ("*\\powershell.exe", "*\\pwsh.exe") CommandLine IN ("*Reflection.Assembly]::Load(*", "*Reflection.Assembly]::LoadFile(*", "*Reflection.Assembly]::LoadFrom(*", "*Reflection.Assembly]::LoadWithPartialName(*", "*Reflection.Assembly]::UnsafeLoadFrom(*", "*[Runtime.InteropServices.Marshal]::Copy(*", "*[Runtime.InteropServices.Marshal]::AllocHGlobal(*", "*[AppDomain]::CurrentDomain.Load(*", "*::Load([Convert]::FromBase64String(*") NOT (ParentImage IN ("*\\devenv.exe", "*\\msbuild.exe")) | table _time,ComputerName,User,Image,CommandLine,ParentImage,ParentCommandLine,ProcessId,ParentProcessId
