index=sysmon (Image="*\\bitsadmin.exe" CommandLine IN ("*/transfer*", "*/create*", "*/addfile*")) OR (Image IN ("*\\powershell.exe", "*\\pwsh.exe") CommandLine IN ("*Start-BitsTransfer*", "*Complete-BitsTransfer*", "*Add-BitsFile*")) NOT (User IN ("*SYSTEM*", "*NETWORK SERVICE*") ParentImage IN ("*\\svchost.exe", "*\\MsMpEng.exe")) | table _time,ComputerName,User,Image,CommandLine,ParentImage,ParentCommandLine,ProcessId,ParentProcessId
