index=sysmon Image IN ("*\\powershell.exe", "*\\pwsh.exe") CommandLine="*Underlay-Copy*" CommandLine IN ("*\\ntds\\ntds.dit*", "*\\config\\SAM*", "*\\config\\SECURITY*", "*\\config\\SYSTEM*") | table _time,ComputerName,User,Image,CommandLine,CurrentDirectory,IntegrityLevel,ParentImage,ParentCommandLine,ProcessId,ParentProcessId
