index=sysmon Image IN ("*\\reg.exe", "*\\PsExec.exe", "*\\PsExec64.exe") OR OriginalFileName IN ("reg.exe", "psexec.c") CommandLine IN ("* save *", "* export *") CommandLine IN ("*HKLM\\SAM*", "*HKLM\\SECURITY*", "*HKLM\\SYSTEM*") | table _time,ComputerName,User,Image,OriginalFileName,CommandLine,CurrentDirectory,IntegrityLevel,ParentImage,ParentCommandLine,ProcessId,ParentProcessId
