index=sysmon TargetImage="*\\lsass.exe" GrantedAccess IN ("*0x1010*", "*0x1410*", "*0x143a*", "*0x1438*", "*0x40*", "*0x1fffff*", "*0x1f1fff*") NOT (SourceImage IN ("*\\lsass.exe", "*\\werfault.exe", "*\\WerFaultSecure.exe", "*\\csrss.exe", "*\\wininit.exe") OR SourceImage IN ("*\\Windows Defender\\*", "*\\Microsoft Security Client\\*", "*\\Malwarebytes\\*", "*\\CrowdStrike\\*", "*\\SentinelOne\\*", "*\\Carbon Black\\*", "*\\Cylance\\*", "*\\Symantec\\*", "*\\McAfee\\*", "*\\Sophos\\*", "*\\ESET\\*", "*\\Kaspersky\\*", "*\\Trend Micro\\*", "*\\Panda Security\\*", "*\\F-Secure\\*")) | table _time,ComputerName,User,SourceImage,TargetImage,GrantedAccess,CallTrace,SourceProcessId,TargetProcessId
