index=sysmon Image IN ("*\\powershell.exe", "*\\pwsh.exe") CommandLine IN ("*ScriptBlockLogging*", "*EnableScriptBlockLogging*", "*EnableScriptBlockInvocationLogging*", "*ModuleLogging*", "*EnableModuleLogging*", "*ProtectedEventLogging*", "*cachedGroupPolicySettings*", "*SOFTWARE\\Policies\\Microsoft\\Windows\\PowerShell*") OR (CommandLine="*Remove-Item*" CommandLine="*Policies\\Microsoft\\Windows\\PowerShell*") | table _time,ComputerName,User,Image,CommandLine,ParentImage,ParentCommandLine,ProcessId,ParentProcessId
