META_START
{
  "title": "Test Sigma Rule",
  "detect_id": "DETECT-2026-0004",
  "description": "Test Sigma rule for demonstration purposes.",
  "sigma_file": "rules/sigma/test2.sigma.yml",
  "level": "medium",
  "status": "test",
  "author": "Bence Marton",
  "date": "2026-01-03",
  "modified": "2026-01-12",

  "convert_time": "2026-03-16T22:21:59+01:00",
  "rule_version": "1.6",
  "git_sha": "8c016eef0a08a2a087623aed89f65c160f37e91d",
  "ci_managed": true,
  "origin": "sigma_to_spl.py",
  "deploy_mode": "alert",
  "sigma_pipeline": "splunk_sysmon_acceleration",

  "references": [
    "https://example.com"
  ],

  "tags": [
    "attack.execution",
    "attack.t1059.001"
  ],

  "logsource": {
    "product_category": "os",
    "product": "windows",
    "service": "sysmon",
    "event_type": "process_creation"
  },

  "falsepositives": [
    "Legitimate administrative scripts using EncodedCommand"
  ]
}
META_END
---
index=sysmon Image="*\\powershell.exe" CommandLine IN ("* -e *", "* -enc *", "* -encodedcommand *") | table CommandLine,ParentImage,Image,User,ProcessId
