title: Test Sigma Rule
id: b835ac80-6e0e-4353-bbc3-1d96d6541d85
detect_id: DETECT-2026-0004
status: test
description: Test Sigma rule for demonstration purposes.
author: Bence Marton
date: 2026-01-03
modified: 2026-01-14
references:
  - https://example.com
tags:
  - attack.execution
  - attack.t1059.001

logsource:
  product_category: os
  product: windows
  service: sysmon
  event_type: process_creation

detection:
  selection_image:
    Image|endswith: '\powershell.exe'
  selection_encoded_flag:
    CommandLine|contains:
      - " -e "
      - " -enc "
      - " -encodedcommand "
  condition: selection_image and selection_encoded_flag

fields:
  - CommandLine
  - ParentImage
  - Image
  - User
  - ProcessId

falsepositives:
  - Legitimate administrative scripts using EncodedCommand

level: low

custom:
  splunk:
    index: sysmon
    mode: alert
    cron: "*/5 * * * *"
    earliest: "-5m"
    latest: "now"
    severity: low

  testing:
    enabled: true
    runner: windows-victim
    type: atomic
    atomics:
      - technique: T1059.001
        test_numbers: [15, 16]
