title: Rule title
id: bfb0d97e-2a3f-4d8b-b97d-0272aa35cc08
status: experimental
description: What does this detect?
author: Bence Marton
date: 2000-12-01
modified: 2000-12-01
references:
  - https://example.com
tags:
  - attack.TA1059
  - attack.T1071
logsource:
  product_category: edr
  product: gcp
  service: dhcp
  event_type: authentication_failure
detection:
  selection:
    Field: Value
  filter:
    Field: Value
    Field|contains:
      - Value1
      - Value2
  condition: selection and not filter
  fields:
    - Field1
    - Field2
falsepositives:
  - Legit admin activity
level: high
